In [81]:
import pandas as pd

In [82]:
url = 'https://raw.githubusercontent.com/lenhattung/SP26-AI1904-DAP391m/refs/heads/main/lab_part_2/01%20-%20Linear%20and%20logistic%20regression/titanic.csv'
df = pd.read_csv(url)

In [83]:
embarked_dummies = pd.get_dummies(df["embarked"], prefix="embarked", drop_first=True)
df = pd.concat([df, embarked_dummies], axis=1)
df = df.drop("embarked", axis=1)
df.head()

,passenger_id,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,boat,body,home.dest,embarked_Q,embarked_S
0,1,1,1,"Allen, Miss. Elisabeth Walton",1,29.0000,0,0,24160,211.3375,B5,2,NaN,"St Louis, MO",False,True
1,2,1,1,"Allison, Master. Hudson Trevor",0,0.9167,1,2,113781,151.5500,C22 C26,11,NaN,"Montreal, PQ / Chesterville, ON",False,True
2,3,1,0,"Allison, Miss. Helen Loraine",1,2.0000,1,2,113781,151.5500,C22 C26,NaN,NaN,"Montreal, PQ / Chesterville, ON",False,True
3,4,1,0,"Allison, Mr. Hudson Joshua Creighton",0,30.0000,1,2,113781,151.5500,C22 C26,NaN,135.0,"Montreal, PQ / Chesterville, ON",False,True
4,5,1,0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",1,25.0000,1,2,113781,151.5500,C22 C26,NaN,NaN,"Montreal, PQ / Chesterville, ON",False,True

In [84]:
a = {0 : 'Male', 1 : 'Female'}
df['sex'] = df['sex'].map(a)
print(df['survived'].unique())
print(df['survived'].value_counts())

[1 0]
survived
0    809
1    500
Name: count, dtype: int64

In [85]:
a = {0 : 'No', 1 : 'Yes'}
df['survived'] = df['survived'].map(a)
print(df['survived'].unique())
print(df['survived'].value_counts())

['Yes' 'No']
survived
No     809
Yes    500
Name: count, dtype: int64

In [86]:
titanic = pd.read_csv(url)
a = {1 : '1st', 2 : '2nd', 3 : '3rd'}
titanic['pclass'] = titanic['pclass'].map(a)
titanic['pclass'] = pd.Categorical(titanic['pclass'], categories = ['1st', '2nd', '3rd'], ordered = True)
print (titanic['pclass'].unique())
print (titanic['pclass'].value_counts())

['1st', '2nd', '3rd']
Categories (3, object): ['1st' < '2nd' < '3rd']
pclass
3rd    709
1st    323
2nd    277
Name: count, dtype: int64